app/controllers/ideas_controller.rb

  def index
    @ideas = Idea.all
---
SELECT `ideas`.* FROM `ideas`

  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO `ideas` (`name`, `description`, `picture`, `created_at`, `updated_at`) VALUES ('aaa', 'hdgdhd', 'lhj', '2017-01-23 01:10:12', '2017-01-23 01:10:12')

  def destroy
    @idea.destroy
---
DELETE FROM `ideas` WHERE `ideas`.`id` = 1

    def set_idea
      @idea = Idea.find(params[:id])
---
SELECT  `ideas`.* FROM `ideas` WHERE `ideas`.`id` = 1 LIMIT 1